# Задача 4:
# Написати програму, яка на вхід приймає список чисел і перевіряє, чи всі числа в цій послідовності є унікальними
numbers = input().split()
import pdb
pdb.set_trace()
if numbers[0] != numbers[1] != numbers[2]:
    print("Unique")
else:
    print("Not unique")


# if len(numbers) == len(set(numbers)):
#     continue

# Couldn't solve the task yet. Need more time to think about it.
